Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: A working *local* container environment: https://docs.docker.com/get-started/get-docker/[Docker] or https://podman.io/docs/installation[Podman]
ja_jp: 動作する *ローカル* のコンテナー環境: https://docs.docker.com/get-started/get-docker/[Docker] または https://podman.io/docs/installation[Podman]

source: A working Docker environment
ja_jp: Dockerが稼働している環境

source: A working container runtime (Docker or Podman)
ja_jp: 動作するコンテナーランタイム(Docker, podman)

source: A working container runtime (Docker or xref:podman.adoc[Podman])
ja_jp: 動作するコンテナランタイム(Docker, xref:podman.adoc[Podman])

source: A working container runtime (Docker, podman)
ja_jp: 動作するコンテナーランタイム(Docker, podman)

source: A xref:configuring-c-development[working C development environment]
ja_jp: xref:configuring-c-development[動作するC言語の開発環境]

source: A xref:platform.adoc#quarkus-platform-bom[Quarkus Platform release BOM] is identified by `groupId:artifactId:version` (GAV) coordinates. When specifying a platform release BOM, you may use empty segments to fall back to default values (shown with `quarkus create app --help`). If you specify only one segment (no `:`), it is assumed to be a version.
ja_jp: xref:platform.adoc#quarkus-platform-bom[Quarkus プラットフォームリリース BOM] は、 `groupId:artifactId:version` (GAV) 座標で識別されます。プラットフォームリリース BOM を指定する場合、空のセグメントを使用してデフォルト値 (`quarkus create app --help` で表示) にフォールバックできます。セグメントを 1 つだけ指定した (`:` を指定しない) 場合、そのセグメントはバージョンと見なされます。

source: A2A Java SDK 1.0.0.Alpha1 - Embracing the 1.0 Specification
ja_jp: A2A Java SDK 1.0.0.Alpha1 - 1.0仕様への対応

source: A2A Java SDK 1.0.0.Alpha2 Released
ja_jp: A2A Java SDK 1.0.0.Alpha2 リリース

source: A2A Java SDK 1.0.0.Alpha2 is now available with telemetry support, push notifications, and important protocol updates aligned with the A2A 1.0 specification.
ja_jp: A2A Java SDK 1.0.0.Alpha2 がリリースされました。テレメトリーのサポート、プッシュ通知、および A2A 1.0 仕様に準拠した重要なプロトコルのアップデートが含まれています。

source: A2A Java SDK 1.0.0.Alpha2 represents a significant step forward in our journey toward full A2A 1.0 specification compliance. The addition of telemetry support and push notifications makes it easier to build production-ready agents, while the protocol updates ensure compatibility with the latest specification.
ja_jp: A2A Java SDK 1.0.0.Alpha2 は、完全な A2A 1.0 仕様準拠への道のりにおける重要な前進です。テレメトリーサポートとプッシュ通知の追加により、本番環境に対応したエージェントの構築が容易になり、プロトコルのアップデートによって最新の仕様との互換性が確保されます。

source: AI blueprints icon
ja_jp: AIブループリントアイコン

source: AI blueprints offer conceptual, infrastructure-agnostic reference architectures for developing enterprise-grade AI solutions in Java. They simplify AI integration in Java applications, guiding software architects in building intelligent chatbots, recommendation engines, and data analysis tools. These blueprints, leveraging Quarkus and LangChain4j, provide a solid starting point for advanced AI capabilities in your Java projects.
ja_jp: AIブループリントは、JavaでエンタープライズグレードのAIソリューションを開発するための、概念的でインフラに依存しない参照アーキテクチャーを提供します。これらはJavaアプリケーションにおけるAI統合を簡素化し、ソフトウェアアーキテクトがインテリジェントなチャットボット、レコメンデーションエンジン、データ分析ツールを構築する際の指針となります。QuarkusとLangChain4jを活用したこれらのブループリントは、Javaプロジェクトにおける高度なAI機能の堅固な出発点となります。

source: AI-Infused application
ja_jp: AI 搭載アプリケーション

source: ALPN is enabled by default.
ja_jp: ALPN はデフォルトで有効になっています。

source: AMQP 1.0 Connector for Reactive Message: allows implementing applications sending and receiving AMQP messages.
ja_jp: AMQP 1.0 Connector for Reactive Message: AMQPメッセージを送受信するアプリケーションを実装できます。

source: AMQP 1.0 Messaging extension integrates with the xref:./tls-registry-reference.adoc[Quarkus TLS registry] to configure the Vert.x AMQP client.
ja_jp: AMQP 1.0 Messaging エクステンションは、 xref:./tls-registry-reference.adoc[Quarkus TLSレジストリ] と統合され、Vert.x AMQPクライアントを設定します。

source: AMQP Body Type
ja_jp: AMQP ボディ型

source: AMQP Client
ja_jp: AMQPクライアント

source: AMQP Connector Configuration Reference
ja_jp: AMQP コネクター設定リファレンス

source: AMQP Data (with binary content) and the `content-type` is set to `application/json`
ja_jp: AMQP データ (バイナリーコンテンツ) で、 `content-type` が `application/json` に設定されている場合。

source: AMQP Data using a binary content. No `content-type` set
ja_jp: バイナリーコンテンツを使用した AMQP データ。 `content-type` が設定されていません

source: AMQP Data using a binary content. The `content-type` is set to `application/json`
ja_jp: バイナリーコンテンツを使用した AMQP データ。 `content-type` は `application/json` に設定されます

source: AMQP Data with a different `content-type`
ja_jp: 異なる `content-type` を持つ AMQP データ

source: AMQP Message Body
ja_jp: AMQP メッセージボディ

source: AMQP Reference
ja_jp: AMQP リファレンス

source: AMQP Sequence
ja_jp: AMQP シーケンス

source: AMQP Value containing a http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-types-v1.0-os.html#section-primitive-type-definitions[AMQP Primitive Type]
ja_jp: http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-types-v1.0-os.html#section-primitive-type-definitions[AMQP Primitive Type] を含む AMQP 値タイプ

source: AMQP Value containing a https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-types-v1.0-os.html#section-primitive-type-definitions[AMQP Primitive Type]
ja_jp: https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-types-v1.0-os.html#section-primitive-type-definitions[AMQP Primitive Type] を含む AMQP 値

source: AMQP Value using the `Binary` type
ja_jp: `Binary` タイプを使用した AMQP 値

source: AMQP Value using the corresponding AMQP Type
ja_jp: 対応する AMQP タイプを使用した AMQP 値

source: AMQP Value with the payload
ja_jp: ペイロードを含む AMQP 値

source: AMQP connector extension
ja_jp: AMQP コネクターエクステンション

source: AMQP messages are sent to a destination. To keep things simple, let's name it __movies__.
ja_jp: AMQPメッセージを送信先に送信します。簡単にするために、 __movies__ という名前にしてみましょう。

source: AMQP reactive messaging connector
ja_jp: AMQP リアクティブメッセージングコネクター

source: AOT JAR packaging
ja_jp: AOT JAR パッケージング

source: AOT-optimized JAR packaging
ja_jp: AOT 最適化された JAR パッケージング

source: API Description
ja_jp: APIの説明

source: API Evolution
ja_jp: APIの進化

source: API Gateway supports many different ways to securely invoke on your HTTP endpoints that are backed by Lambda and Quarkus. If you enable it, Quarkus will automatically parse relevant parts of the https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api-develop-integrations-lambda.html[event json document] and look for security based metadata and register a `java.security.Principal` internally that can be looked up in JAX-RS by injecting a `javax.ws.rs.core.SecurityContext`, via `HttpServletRequest.getUserPrincipal()` in servlet, and `RouteContext.user()` in Reactive Routes. If you want more security information, the `Principal` object can be typecast to a class that will give you more information.
ja_jp: API Gateway は、Lambda および Quarkus がサポートする HTTP エンドポイントで安全に呼び出すためのさまざまな方法をサポートしています。これを有効にすると、Quarkus は https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api-develop-integrations-lambda.html[event json document] の関連部分を自動的に解析して、セキュリティーベースのメタデータを検索し、サーブレットの `HttpServletRequest.getUserPrincipal()` および Reactive Routes の `RouteContext.user()` を介して `javax.ws.rs.core.SecurityContext` を挿入することにより、JAX-RS で検索できる `java.security.Principal` を内部的に登録します。より多くのセキュリティー情報が必要な場合は、 `Principal` オブジェクトをクラスに型キャストしてより多くの情報を提供できます。

source: API Gateway supports many ways to securely invoke on your HTTP endpoints that are backed by Lambda and Quarkus. If you enable it, Quarkus will automatically parse relevant parts of the https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api-develop-integrations-lambda.html[event json document] and look for security based metadata and register a `java.security.Principal` internally that can be looked up in JAX-RS by injecting a `javax.ws.rs.core.SecurityContext`, via `HttpServletRequest.getUserPrincipal()` in servlet, and `RouteContext.user()` in Reactive Routes. If you want more security information, the `Principal` object can be typecast to a class that will give you more information.
ja_jp: API Gateway は、Lambda および Quarkus がサポートする HTTP エンドポイントで安全に呼び出すためのさまざまな方法をサポートしています。これを有効にすると、Quarkus は https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api-develop-integrations-lambda.html[event json document] の関連部分を自動的に解析して、セキュリティーベースのメタデータを検索し、サーブレットの `HttpServletRequest.getUserPrincipal()` および Reactive Routes の `RouteContext.user()` を介して `javax.ws.rs.core.SecurityContext` を挿入することにより、JAX-RS で検索できる `java.security.Principal` を内部的に登録します。より多くのセキュリティー情報が必要な場合は、 `Principal` オブジェクトをクラスに型キャストしてより多くの情報を提供できます。

source: API Gateway supports many ways to securely invoke on your HTTP endpoints that are backed by Lambda and Quarkus. If you enable it, Quarkus will automatically parse relevant parts of the https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api-develop-integrations-lambda.html[event json document] and look for security based metadata and register a `java.security.Principal` internally that can be looked up in Jakarta REST by injecting a `jakarta.ws.rs.core.SecurityContext`, via `HttpServletRequest.getUserPrincipal()` in servlet, and `RouteContext.user()` in Reactive Routes. If you want more security information, the `Principal` object can be typecast to a class that will give you more information.
ja_jp: API Gateway は、Lambda および Quarkus がサポートする HTTP エンドポイントで安全に呼び出すためのさまざまな方法をサポートしています。 これを有効にすると、Quarkus は https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api-develop-integrations-lambda.html[event json document] の関連部分を自動的に解析して、セキュリティーベースのメタデータを検索し、 サーブレットの `HttpServletRequest.getUserPrincipal()` および Reactive Routes の `RouteContext.user()` を介して `javax.ws.rs.core.SecurityContext` を挿入することにより、Quarkus REST で検索できる `jakarta.security.Principal` を内部的に登録します。 より多くのセキュリティー情報が必要な場合は、 `Principal` オブジェクトをクラスに型キャストしてより多くの情報を提供できます。

source: API Title
ja_jp: APIタイトル

source: API Version
ja_jp: API バージョン

source: API approach
ja_jp: APIアプローチ

source: API differences
ja_jp: API の違い

source: API microservice
ja_jp: API マイクロサービス

source: API returning `Uni` can be used directly using `uni.await().atMost(...)`. It blocks the virtual thread, without blocking the carrier thread, and also improves the resilience of your application with an easy (non-blocking) timeout support.
ja_jp: `Uni` を返す API は、 `uni.await().atMost(...)` を使用して直接使用できます。これは、キャリアースレッドをブロックせずに仮想スレッドをブロックし、簡単な (非ブロッキング) タイムアウトサポートによってアプリケーションの耐障害性も向上させます。

source: AWS Lambda SnapStart Configuration
ja_jp: AWS Lambda SnapStartの設定

source: AWS Lambda support
ja_jp: AWS Lambda サポート

source: AWS Lambda supports creating your lambdas by referencing https://docs.aws.amazon.com/lambda/latest/dg/lambda-images.html[container images] rather than uploading ZIP files. This can have some benefits such as bypassing the size limit of the uploaded ZIP files. You can define lambda functions for both native builds and regular JVM builds.
ja_jp: AWS Lambda は、ZIP ファイルをアップロードするのではなく、 https://docs.aws.amazon.com/lambda/latest/dg/lambda-images.html[コンテナイメージ] を参照してラムダを作成することをサポートしています。これは、アップロードされた ZIP ファイルのサイズ制限を回避できるなどの利点があります。ネイティブビルドと通常の JVM ビルドの両方でラムダ関数を定義できます。

source: AWS Lambda with Quarkus REST, Undertow, or Reactive Routes
ja_jp: Quarkus REST、Undertow、またはReactive Routesを使用したAWS Lambda

source: AWS Lambda with RESTEasy Reactive, Undertow, or Reactive Routes
ja_jp: RESTEasy Reactive、Undertow、あるいはReactive Routesを使用したAWS Lambda

source: AWS X-Ray does add many classes to your distribution, do ensure you are using at least the 256MB AWS Lambda memory size. This is explicitly set in `manage.sh` `cmd_create()`. Whilst the native image potentially can always use a lower memory setting, it would be recommended to keep the setting the same, especially to help compare performance.
ja_jp: AWS X-Ray はディストリビューションに多くのクラスを追加しますが、最低でも256MBのAWS Lambdaメモリーサイズを使用していることを確認してください。これは `manage.sh` `cmd_create()` で明示的に設定されています。ネイティブイメージは常により低いメモリー設定を使用できる可能性がありますが、特にパフォーマンスを比較するためには同じ設定にしておくことをお勧めします。

source: AWS request signing is not available at the moment, unlike in the xref:hibernate-search-orm-elasticsearch.adoc#aws-request-signing[Hibernate Search extension with Hibernate ORM]
ja_jp: xref:hibernate-search-orm-elasticsearch.adoc#aws-request-signing[Hibernate ORM を使用した Hibernate Search エクステンション] とは異なり、 AWS リクエスト署名は現在利用できません。

source: AWT extension
ja_jp: AWTエクステンション

source: AWT image resize via new AWT extension
ja_jp: 新しいAWTエクステンションによるAWTイメージのリサイズ

source: Ability to add HTTP headers to responses
ja_jp: レスポンスにHTTPヘッダーを追加する機能

source: Ability to handle 'final' classes and methods
ja_jp: final クラスとメソッドを処理する能力

source: Ability to inject a bean with "narrower" scope to a bean with "wider" scope; i.e. you can inject a `@RequestScoped` bean into an `@ApplicationScoped` bean.
ja_jp: 「狭い」スコープのBeanを「広い」スコープのBeanに注入する機能、すなわち、 `@RequestScoped` Beanを `@ApplicationScoped` Beanに注入することができます。

source: Able to handle reactive or imperative naturally
ja_jp: リアクティブにも命令的にも自然に対応できる

source: About
ja_jp: Quarkusについて

source: About Abraxas
ja_jp: Abraxasについて

source: About Eclipse Adoptium
ja_jp: Eclipse Adoptiumについて

source: About OpenAPI document paths
ja_jp: OpenAPIドキュメントパスについて

source: About Quarkus documentation
ja_jp: Quarkus のドキュメントについて

source: About bean references
ja_jp: Bean参照について

source: About entity identifiers
ja_jp: エンティティ識別子について

source: About serialization
ja_jp: シリアライゼーションについて

source: About the Duration format
ja_jp: 期間フォーマットについて

source: About the MemorySize format
ja_jp: MemorySizeフォーマットについて

source: About to release Quarkus 2 - ask us anything!
ja_jp: Quarkus 2リリースはもう直ぐです - 何でも聞いてください。

source: Above will adapt the `Long` java type to an `Int` Scalar type, rather than the https://download.eclipse.org/microprofile/microprofile-graphql-1.0/microprofile-graphql.html#scalars[default] `BigInteger`.
ja_jp: 上記では、 `Long` java型を、 link:https://download.eclipse.org/microprofile/microprofile-graphql-1.0/microprofile-graphql.html#scalars[デフォルト] の `BigInteger` ではなく、 `Int` スカラー型に変換しています。

source: Above will fetch the film on the event-loop threads, but switch to the worker thread to fetch the heroes.
ja_jp: 上記では、イベントループのスレッドで映画を取得しますが、ヒーローを取得するためにワーカスレッドに切り替えます。

source: Above will map the `Long` java type to an `Int` Scalar type, rather than the https://download.eclipse.org/microprofile/microprofile-graphql-1.0/microprofile-graphql.html#scalars[default] `BigInteger`.
ja_jp: 上記では、 `Long` java型を、 link:https://download.eclipse.org/microprofile/microprofile-graphql-1.0/microprofile-graphql.html#scalars[デフォルト] の `BigInteger` ではなく、 `Int` スカラー型にマッピングしています。

source: Abraxas Informatik AG is the largest provider of integrated IT solutions for the public sector in Switzerland. Abraxas connects Swiss administrations, authorities, companies and the population with efficient, secure and integrated solutions and services in the field of information and communication technology.
ja_jp: Abraxas Informatik AGは、スイスの公共部門に統合ITソリューションを提供する最大の企業です。Abraxasは、情報通信技術の分野で、効率的で安全な統合されたソリューションとサービスで、スイスの行政、当局、企業、国民を結びつけています。

source: Abraxas Uses Quarkus For Cutting Edge Tax App
ja_jp: Abraxasが最先端の税務アプリにQuarkusを採用

source: Abraxas formed a specialized group of experts (Team Polaris) to architect, develop, and deploy the tax solution. While the Polaris team is a part of a larger organization, it acts very much like a startup. This provided the team with the ability to identify and implement the best technology for the job in order to meet the needs of their customers.
ja_jp: Abraxas は、税務ソリューションを設計、開発、展開するために、専門家のグループ（チームポラリス）を結成しました。ポラリスチームは、大規模な組織の一部ではありますが、スタートアップに近い形で活動しています。このチームは、お客様のニーズを満たすために、最適なテクノロジーを見極め、導入することができました。

source: Abraxas is Hiring
ja_jp: Abraxasは採用中です

source: Abraxas is developing its products with a "cloud first" strategy where the tax application needs to be deployed in a clustered, scalable, secure environment that is browser-based. Abraxas was able to leverage its own cloud platform “Abraxas Government Cloud” which offers a Kubernetes-based cloud solution to its customers.
ja_jp: Abraxasは「クラウドファースト」戦略で製品を開発しており、税務アプリケーションはブラウザベースのクラスター化されたスケーラブルでセキュアな環境に展開される必要があります。Abraxasは、Kubernetesベースのクラウドソリューションを顧客に提供している自社のクラウドプラットフォーム「Abraxas Government Cloud」を活用することができました。

source: Abraxas is the largest provider of integrated IT solutions for the public sector in Switzerland. They made a strategic decision to create a new modular, cloud-native tax solution that could be used throughout Switzerland’s cantons and municipalities to implement tax laws. Each canton and municipality has different rules and requirements for taxing its citizens which posed a unique challenge for the team.
ja_jp: Abraxas社は、スイスの公共部門向けに統合ITソリューションを提供する最大手の企業です。Abraxas社は、スイスの州や市町村が税法を施行する際に使用できる、モジュール式のクラウド・ネイティブな税務ソリューションを新たに開発するという戦略的な決断を下しました。各州や市町村は、市民への課税に関する規則や要件が異なるため、チームには独自の課題がありました。

source: Absolute `Back-Channel Logout` URL is calculated by adding `quarkus.oidc.back-channel-logout.path` to the current endpoint URL, for example, `http://localhost:8080/back-channel-logout`. You will need to configure this URL in the Admin Console of your OpenID Connect Provider.
ja_jp: 絶対的な `Back-Channel Logout` URL は、現在のエンドポイント URL に `quarkus.oidc.back-channel-logout.path` を追加することで算出されます (例: `http://localhost:8080/back-channel-logout`)。この URL は、OpenID Connect Provider の Admin Console で設定する必要があります。

source: Absolute paths also have an impact on nested endpoints. If the above called `nestedRoute("custom-endpoint", "/deep")`, the resulting endpoint will be found at `/deep`.
ja_jp: 絶対パスは、ネストされたエンドポイントにも影響を与えます。上記が `nestedRoute ("custom-endpoint"、"/deep")` を呼び出した場合、生成されるエンドポイントは `/deep` にあります。

source: Absolute paths are handled differently. If the above called `route("/custom-endpoint")`, the resulting endpoint will be found at `/custom-endpoint`.
ja_jp: 絶対パスは異なる方法で処理されます。上記が `route("/custom-endpoint")` を呼び出すと、生成されるエンドポイントは '/custom-endpoint' に保存されます。

source: Absolutely not!
ja_jp: もちろん違います。

source: Absolutely!
ja_jp: 勿論!

source: Abstract A - All Rock'n Roll and Big Drum Solos
ja_jp: 概要 A - ロックンロールと大迫力のドラムソロ

source: Abstract B - More Easy Listening
ja_jp: 概要 B - よりイージーリスニング

source: Abstract Types
ja_jp: 抽象型

source: Abstracts (preamble)
ja_jp: アブストラクト (前文)

source: Accept JWT as a cookie
ja_jp: JWTをCookieとして受入

source: Accept JWT as cookie
ja_jp: JWTをCookieとして受け入れる

source: Accepting user input
ja_jp: ユーザー入力の受け入れ

source: Access Git repositories with JGit
ja_jp: JGit で Git リポジトリにアクセス

source: Access Quarkus with opaque Auth0 access tokens
ja_jp: 不透明 Auth0 アクセストークンを使用して Quarkus にアクセスする

source: Access Token is usually used by the OIDC `web-app` application to access other endpoints on behalf of the currently logged in user. The raw access token can be accessed as follows:
ja_jp: アクセストークンは通常、OIDC `web-app` アプリケーションが、現在ログインしているユーザーに代わって他のエンドポイントにアクセスするために使用されます。生のアクセストークンは、以下のようにアクセスすることができます:

source: Access Token is usually used by the OIDC `web-app` application to access other endpoints on behalf of the currently logged-in user. The raw access token can be accessed as follows:
ja_jp: アクセストークンは通常、OIDC `web-app` アプリケーションが、現在ログインしているユーザーの代わりに他のエンドポイントにアクセスするために使用されます。生のアクセストークンは以下のようにアクセスすることができます。

source: Access `/api/admin`, which returns `200`.
ja_jp: `/api/admin` にアクセスすると、 `200` が返されます。

source: Access `/api/admin`, which returns `403`.
ja_jp: `/api/admin` にアクセスすると、 `403` が返されます。

source: Access `/api/users/me`, which returns `200`.
ja_jp: `/api/users/me` にアクセスすると、 `200` が返されます。

source: Access `/frontend/admin-name-with-propagated-token`, which returns `200`.
ja_jp: `/frontend/admin-name-with-propagated-token` にアクセスすると、 `200` が返されます。

source: Access `/frontend/admin-name-with-propagated-token`, which returns `403`.
ja_jp: `/frontend/admin-name-with-propagated-token` にアクセスすると、 `403` が返されます。

source: Access `/frontend/user-name-with-propagated-token`, which returns `200`.
ja_jp: `/frontend/user-name-with-propagated-token` にアクセスすると、 `200` が返されます。

source: Access `AuthorizationCodeTokens` tokens associated with the now expired session as a `RoutingContext` attribute.
ja_jp: 期限切れになったセッションに関連付けられた `AuthorizationCodeTokens` トークンに、 `RoutingContext` 属性としてアクセスします。

source: Access `AuthorizationCodeTokens` tokens associated with the now-expired session as a `RoutingContext` attribute.
ja_jp: 期限切れになったセッションに関連付けられた `AuthorizationCodeTokens` トークンに、 `RoutingContext` 属性としてアクセスします。

source: Access allowed
ja_jp: アクセスが許可されました

source: Access and test the application security
ja_jp: アプリケーションのセキュリティへのアクセスおよびテスト

source: Access and test the application security with Curl
ja_jp: Curl を使用してアプリケーションのセキュリティーにアクセスし、テストする

source: Access and test the application security with the browser
ja_jp: ブラウザーでアプリケーションのセキュリティーにアクセスしてテストする

source: Access control is managed as follows:
ja_jp: アクセス制御は次のように管理されます。

source: Access forbidden
ja_jp: アクセス禁止

source: Access is granted to `getItem` if `SecurityIdentity` has either `read` permission or `see` permission and one of the `all` or `detail` actions.
ja_jp: `SecurityIdentity` に `read` 権限または `see` 権限と、 `all` アクションまたは `detail` アクションのどちらかがある場合は、 `getItem` へのアクセスが許可されます。

source: Access provider services with token propagation
ja_jp: トークン伝播によるプロバイダーサービスへのアクセス

source: Access the Vert.x instance
ja_jp: Vert.xインスタンスへのアクセス

source: Access the downstream service with this access token
ja_jp: このアクセストークンを使用したダウンストリームサービスへのアクセス

source: Access the management UI
ja_jp: 管理UIにアクセスする

source: Access the programmatic mapping context.
ja_jp: プログラムによるマッピングコンテキストにアクセスします。

source: Access to Public Resources
ja_jp: パブリックリソースへのアクセス

source: Access to a Kubernetes cluster (Minikube is a viable option)
ja_jp: Kubernetesクラスターへのアクセス（Minikubeは有効な選択肢です）

source: Access to an OpenShift cluster (Minishift is a viable option)
ja_jp: OpenShiftクラスターへのアクセス（Minishiftも実行可能なオプションです）

source: Access to public resources
ja_jp: パブリックリソースへのアクセス

source: Access to runtime metadata and tools
ja_jp: ランタイムメタデータとツールへのアクセス

source: Access to the Kubernetes API
ja_jp: Kubernetes APIへのアクセス

source: Access to the current user and roles
ja_jp: 現在のユーザーとロールへのアクセス

source: Access to these endpoints is controlled by using bearer tokens. To gain access, the following conditions must be met:
ja_jp: これらのエンドポイントへのアクセスは、ベアラートークンを使用して制御されます。 アクセスするには、次の条件を満たす必要があります。

source: Access token: The Quarkus web-app might use the access token to access the UserInfo API to get additional information about the authenticated user or propagate it to another endpoint.
ja_jp: アクセス トークン: Quarkus ウェブアプリは、アクセス トークンを使用して UserInfo API にアクセスし、認証されたユーザーに関する追加情報を取得したり、別のエンドポイントに伝達したりします。

source: Access token: The Quarkus web-app might use the access token to access the UserInfo API to get additional information about the authenticated user or to propagate it to another endpoint.
ja_jp: アクセストークン: Quarkus web-app は、アクセストークンを使用して UserInfo API にアクセスし、認証されたユーザーに関する追加情報を取得したり、別のエンドポイントに伝播したりすることがあります。

source: Access tokens in JWT format
ja_jp: JWT形式のアクセストークン

source: Access your Git repositories
ja_jp: Git リポジトリーにアクセスする

source: Access your Keycloak server at http://localhost:8180[localhost:8180].
ja_jp: http://localhost:8180[localhost:8180] で Keycloak サーバーにアクセスします。

source: Access your application endpoint by using `https://your-domain-name:8443/`; for example, `https://your-domain-name:8443/hello`, and accept a self-signed certificate in the browser.
ja_jp: `https://your-domain-name:8443/` を使用してアプリケーションエンドポイントにアクセスし (例: `https://your-domain-name:8443/hello`)、ブラウザーで自己署名証明書を受け入れます。

source: Access your application's endpoint again at `https://your-domain-name:8443/`. Confirm that the browser shows Let's Encrypt as the certificate issuer.
ja_jp: `https://your-domain-name:8443/` でアプリケーションのエンドポイントに再度アクセスします。ブラウザーに証明書発行者として Let's Encrypt が表示されていることを確認します。

source: Access your application's endpoint using `https://your-domain-name:8443/` again. Confirm in the browser that the Let's Encrypt certificate authority is now signing your domain certificate.
ja_jp: `https://your-domain-name:8443/` を使用して、アプリケーションのエンドポイントに再度アクセスします。 ブラウザーで、Let's Encrypt 認証局がドメイン証明書に署名することを確認します。
